GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq >= SysTick_IRQn)
    {	
	return LORAMAC_STATUS_BUSY;
    }
    else if (irq >= SVC_IRQn)
    {
	return LoRaMacMlmeRequest(mlmeRequest);
    }
    else
    {
	return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMlmeRequest, (uint32_t)mlmeRequest);
    }
}

static LoRaMacStatus_t LoRaWANMcpsRequest( McpsReq_t *mcpsRequest )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq >= SysTick_IRQn)
    {	
	return LORAMAC_STATUS_BUSY;
    }
    else if (irq >= SVC_IRQn)
    {
	return LoRaMacMcpsRequest(mcpsRequest);
    }
    else
    {
	return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMcpsRequest, (uint32_t)mcpsRequest);
    }
}

static uint8_t LoRaWANGetBatteryLevel()
{
    if (STM32L0.getVBUS()) {
	return BAT_LEVEL_EXT_SRC;
    }

#if defined(STM32L0_CONFIG_VBAT_EMPTY) && defined(STM32L0_CONFIG_VBAT_FULL)
    float vbat = STM32L0.getVBAT();

    if (vbat < STM32L0_CONFIG_VBAT_EMPTY) {
	return BAT_LEVEL_EMPTY;
    }

    if (vbat > STM32L0_CONFIG_VBAT_FULL) {
	return BAT_LEVEL_FULL;
    }

    return (uint8_t)(((vbat - STM32L0_CONFIG_VBAT_EMPTY) / (STM32L0_CONFIG_VBAT_FULL - STM32L0_CONFIG_VBAT_EMPTY)) * (BAT_LEVEL_FULL - BAT_LEVEL_EMPTY) + BAT_LEVEL_EMPTY);

#else /*  defined(STM32L0_CONFIG_VBAT_EMPTY) && defined(STM32L0_CONFIG_VBAT_FULL) */

    return BAT_LEVEL_NO_MEASURE;

#endif /*  defined(STM32L0_CONFIG_VBAT_EMPTY) && defined(STM32L0_CONFIG_VBAT_FULL) */
}

LoRaWANClass::LoRaWANClass()
{
    _initialized = false;

    _tx_port = 1;
    _tx_active = false;
    _tx_ack = 0;
    _tx_busy = false;

    _rx_index = 0;
    _rx_size = 0;
    _rx_ack = 0;

    _JoinRetries = 3;
    _ConfirmRetries = 8;

    _PublicNetwork = true;
    _AdrEnable = true;
    _DataRate = 0;
    _TxPower = 0;

    _session.Joined = LORAWAN_JOINED_NONE;
}

LoRaMacPrimitives_t LoRaWANPrimitives;
LoRaMacCallback_t LoRaWANCallbacks;

static const LoRaMacRegion_t *LoRaWANRegions[] = {
    &LoRaMacRegionAS923,
    &LoRaMacRegionAU915,
    &LoRaMacRegionEU868,
    &LoRaMacRegionIN865,
    &LoRaMacRegionKR920,
    &LoRaMacRegionUS915,
};

static const uint8_t LoRaWANTxPowerAS923[11] = { 16, 14, 12, 10,  8,  6,  4,  2,  0,  0,  0 };
static const uint8_t LoRaWANTxPowerAU915[11] = { 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10 };
static const uint8_t LoRaWANTxPowerEU868[11] = { 16, 14, 12, 10,  8,  6,  4,  2,  0,  0,  0 };
static const uint8_t LoRaWANTxPowerIN865[11] = { 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10 };
static const uint8_t LoRaWANTxPowerKR920[11] = { 14, 12, 10,  8,  6,  4,  2,  0,  0,  0,  0 };
static const uint8_t LoRaWANTxPowerUS915[11] = { 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10 };

static const uint8_t *LoRaWANTxPower[] = {
    &LoRaWANTxPowerAS923[0],
    &LoRaWANTxPowerAU915[0],
    &LoRaWANTxPowerEU868[0],
    &LoRaWANTxPowerIN865[0],
    &LoRaWANTxPowerKR920[0],
    &LoRaWANTxPowerUS915[0],
};

int LoRaWANClass::begin(LoRaWANBand band)
{
    MibRequestConfirm_t mibReq;

    if (__get_IPSR() != 0) {
	return 0;
    }

    _Band = band;

    LoRaWANPrimitives.MacMcpsConfirm = __McpsConfirm;
    LoRaWANPrimitives.MacMcpsIndication = __McpsIndication;
    LoRaWANPrimitives.MacMlmeConfirm = __MlmeConfirm;
    LoRaWANCallbacks.GetBatteryLevel = LoRaWANGetBatteryLevel;
    LoRaMacInitialization(&LoRaWANPrimitives, &LoRaWANCallbacks, LoRaWANRegions[band]);

    mibReq.Type = MIB_PUBLIC_NETWORK;
    mibReq.Param.EnablePublicNetwork = _PublicNetwork;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_ADR;
    mibReq.Param.AdrEnable = _AdrEnable;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_DEFAULT_DATARATE;
    mibReq.Param.ChannelsDefaultDatarate = _DataRate;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_DATARATE;
    mibReq.Param.ChannelsDatarate = _DataRate;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_DEFAULT_TX_POWER;
    mibReq.Param.ChannelsDefaultTxPower = _TxPower;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_TX_POWER;
    mibReq.Param.ChannelsTxPower = _TxPower;
    LoRaMacMibSetRequestConfirm(&mibReq);

    _initialized = true;

    return 1;
}

int LoRaWANClass::joinOTAA(const char *appEui, const char *appKey, const char *devEui)
{
    MlmeReq_t mlmeReq;

    if (!_initialized) {
        return 0;
    }

    if (devEui == NULL)
    {
	BoardGetUniqueId(_session.DevEui);
    }
    else
    {
	if (!ConvertString(_session.DevEui, 8, devEui)) {
	    return 0;
	}
    }

    if (!ConvertString(_session.AppEui, 8, appEui)) {
	return 0;
    }

    if (!ConvertString(_session.AppKey, 16, appKey)) {
	return 0;
    }

    mlmeReq.Type = MLME_JOIN;
    mlmeReq.Req.Join.DevEui = _session.DevEui;
    mlmeReq.Req.Join.AppEui = _session.AppEui;
    mlmeReq.Req.Join.AppKey = _session.AppKey;
    mlmeReq.Req.Join.NbTrials = 1 + _JoinRetries;

    if (LoRaWANMlmeRequest(&mlmeReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    _session.Joined = LORAWAN_JOINED_NONE;
    _session.DataRate = _DataRate;
    _session.TxPower = _TxPower;
    _session.UpLinkCounter = 0;
    _session.DownLinkCounter = 0;

    _tx_busy = true;

    return 1;
}

int LoRaWANClass::joinABP(const char *devAddr, const char *nwkSKey, const char *appSKey)
{
    MibRequestConfirm_t mibReq;
    
    if (!_initialized) {
        return 0;
    }

    if (!ConvertString((uint8_t*)&_session.DevAddr, 4, devAddr)) {
	return 0;
    }

    if (!ConvertString(_session.NwkSKey, 16, nwkSKey)) {
	return 0;
    }

    if (!ConvertString(_session.AppSKey, 16, appSKey)) {
	return 0;
    }

    _session.Joined = LORAWAN_JOINED_ABP;
    _session.DataRate = _DataRate;
    _session.TxPower = _TxPower;
    _session.UpLinkCounter = 0;
    _session.DownLinkCounter = 0;

    memset(_session.DevEui, 0, 8);
    memset(_session.AppEui, 0, 8);
    memset(_session.AppKey, 0, 16);

    mibReq.Type = MIB_UPLINK_COUNTER;
    mibReq.Param.UpLinkCounter = _session.UpLinkCounter;
    LoRaWANMibSetRequestConfirm(&mibReq);

