GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
    mibReq.Type = MIB_DOWNLINK_COUNTER;
    mibReq.Param.DownLinkCounter = _session.DownLinkCounter;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_NET_ID;
    mibReq.Param.NetID = 0;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_DEV_ADDR;
    mibReq.Param.DevAddr = _session.DevAddr;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_NWK_SKEY;
    mibReq.Param.NwkSKey = _session.NwkSKey;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_APP_SKEY;
    mibReq.Param.AppSKey = _session.AppSKey;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_NETWORK_JOINED;
    mibReq.Param.IsNetworkJoined = true;
    LoRaWANMibSetRequestConfirm(&mibReq);

    _tx_ack = 1;
    _tx_busy = false;

    return 1;
}

bool LoRaWANClass::connected()
{
    return (_session.Joined != LORAWAN_JOINED_NONE);
}

int LoRaWANClass::ready()
{
    if (_session.Joined == LORAWAN_JOINED_NONE) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    return (_tx_ack ? _tx_ack : -1);
}

void LoRaWANClass::beginPacket(uint8_t port)
{
    if (_session.Joined == LORAWAN_JOINED_NONE) {
        return;
    }

    if (_tx_active) {
	return;
    }

    if ((port < 1) || (port > 223)) {
	return;
    }

    _tx_size = 0;
    _tx_port = port;
    _tx_active = true;
}

int LoRaWANClass::endPacket(bool confirmed)
{
    if (!_tx_active) {
	return 0;
    }

    _tx_active = false;

    return sendPacket(_tx_port, &_tx_data[0], _tx_size, confirmed);
}

int LoRaWANClass::sendPacket(const uint8_t *buffer, size_t size, bool confirmed)
{
    return sendPacket(LORAWAN_DEFAULT_PORT, buffer, size, confirmed);
}

int LoRaWANClass::sendPacket(uint8_t port, const uint8_t *buffer, size_t size, bool confirmed)
{
    McpsReq_t mcpsReq;
    LoRaMacTxInfo_t txInfo;

    if (_session.Joined == LORAWAN_JOINED_NONE) {
        return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    _tx_ack = 0;
    _tx_busy = true;

    if (size == 0)
    {
        // Send empty frame in order to flush MAC commands
        mcpsReq.Type = MCPS_UNCONFIRMED;
        mcpsReq.Req.Unconfirmed.fBuffer = NULL;
        mcpsReq.Req.Unconfirmed.fBufferSize = 0;
        mcpsReq.Req.Unconfirmed.Datarate = _DataRate;

	if (LoRaWANMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK)
	{
	    _tx_busy = false;

	    return 0;
	}
    }
    else
    {
	if (LoRaWANQueryTxPossible(size, &txInfo) != LORAMAC_STATUS_OK)
	{
	    // Send empty frame in order to flush MAC commands
	    mcpsReq.Type = MCPS_UNCONFIRMED;
	    mcpsReq.Req.Unconfirmed.fBuffer = NULL;
	    mcpsReq.Req.Unconfirmed.fBufferSize = 0;
	    mcpsReq.Req.Unconfirmed.Datarate = _DataRate;

	    if (LoRaWANMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK)
	    {
		_tx_busy = false;
	    }

	    return 0;
	}
	else
	{
	    if (confirmed)
	    {
		_tx_ack = false;

		mcpsReq.Type = MCPS_CONFIRMED;
		mcpsReq.Req.Confirmed.fPort = port;
		mcpsReq.Req.Confirmed.fBuffer = (uint8_t*)buffer;
		mcpsReq.Req.Confirmed.fBufferSize = size;
		mcpsReq.Req.Confirmed.NbTrials = 1 + _ConfirmRetries;
		mcpsReq.Req.Confirmed.Datarate = _DataRate;
	    }
	    else
	    {
		mcpsReq.Type = MCPS_UNCONFIRMED;
		mcpsReq.Req.Unconfirmed.fPort = port;
		mcpsReq.Req.Unconfirmed.fBuffer = (uint8_t*)buffer;
		mcpsReq.Req.Unconfirmed.fBufferSize = size;
		mcpsReq.Req.Unconfirmed.Datarate = _DataRate;
	    }

	    if (LoRaWANMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK)
	    {
		_tx_busy = false;
	    
		return 0;
	    }
	}
    }

    _rx_index = 0;
    _rx_size = 0;

    return 1;
}

size_t LoRaWANClass::write(uint8_t data)
{
    if (!_tx_active) {
	return 0;
    }

    if (_tx_size >= LORAWAN_MAX_PAYLOAD_SIZE) {
	return 0;
    }

    _tx_data[_tx_size++] = data;

    return 1;
}

size_t LoRaWANClass::write(const uint8_t *data, size_t size)
{
    if (!_tx_active) {
	return 0;
    }

    if (size > (unsigned int)(LORAWAN_MAX_PAYLOAD_SIZE - _tx_size)) {
	size = LORAWAN_MAX_PAYLOAD_SIZE - _tx_size;
    }

    memcpy(&_tx_data[_tx_size], data, size);

    _tx_size += size;

    return size;
}

int LoRaWANClass::parsePacket()
{
    return available();
}

int LoRaWANClass::available()
{
    return (_rx_size - _rx_index);
}

int LoRaWANClass::read()
{
    if (_rx_index >= _rx_size) {
	return -1;
    }

    return _rx_data[_rx_index++];
}

size_t LoRaWANClass::read(uint8_t *buffer, size_t size)
{
    if (size > (unsigned int)(_rx_size - _rx_index))
    {
	size = (_rx_size - _rx_index);
    }

    memcpy(buffer, &_rx_data[_rx_index], size);

    _rx_index += size;

    return size;
}

int LoRaWANClass::peek(void)
{
    if (_rx_index >= _rx_size) {
	return -1;
    }

    return _rx_data[_rx_index];
}

void LoRaWANClass::flush()
{
}

uint8_t LoRaWANClass::remotePort()
{
    return _rx_port;
}

int LoRaWANClass::packetRSSI()
{
    return _rx_rssi;
}

int LoRaWANClass::packetSNR()
{
    return _rx_snr;
}

void LoRaWANClass::linkCheck()
{
    MlmeReq_t mlmeReq;

    if (_session.Joined == LORAWAN_JOINED_NONE) {
        return;
    }

    _rx_ack = false;

    mlmeReq.Type = MLME_LINK_CHECK;
    LoRaWANMlmeRequest( &mlmeReq );
}

int LoRaWANClass::linkMargin()
{
    if (!_rx_ack) {
	return -1;
    }

    return _rx_margin;
}

int LoRaWANClass::linkGateways()
{
    if (!_rx_ack) {
	return -1;
    }

    return _rx_gateways;
}

void LoRaWANClass::onReceive(void(*callback)(void))
{
    _receiveCallback = callback;
}

void LoRaWANClass::onTransmit(void(*callback)(void))
{
    _transmitCallback = callback;
}

int LoRaWANClass::getDevEui(char *buffer, size_t size)
{
    uint8_t DevEui[8];
    unsigned int i;
    
    static const char xlate[17] = "0123456789abcdef";

    if (size < 17) {
	return 0;
    }

    BoardGetUniqueId(DevEui);

    for (i = 0; i < 8; i++)
    {
	*buffer++ = xlate[DevEui[i] >> 4];
	*buffer++ = xlate[DevEui[i] & 15];
    }

    *buffer++ = '\0';

    return 1;
}

int LoRaWANClass::getMaxPayloadSize()
{
    LoRaMacTxInfo_t txInfo;

    if (LoRaWANQueryTxPossible(0, &txInfo) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return txInfo.CurrentPayloadSize;
}

