GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
unsigned int LoRaWANClass::getDataRate()
{
    return _session.DataRate;
}

unsigned int LoRaWANClass::getTxPower()
{
    return LoRaWANTxPower[_Band][_session.TxPower];
}

unsigned long LoRaWANClass::getUpLinkCounter()
{
    return _session.UpLinkCounter;
}

unsigned long LoRaWANClass::getDownLinkCounter()
{
    return _session.DownLinkCounter;
}

int LoRaWANClass::setJoinDelay1(unsigned int delay)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    if (delay > 65535) {
	return 0;
    }

    mibReq.Type = MIB_JOIN_ACCEPT_DELAY_1;
    mibReq.Param.JoinAcceptDelay1 = delay;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::setJoinDelay2(unsigned int delay)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    if (delay > 65535) {
	return 0;
    }

    mibReq.Type = MIB_JOIN_ACCEPT_DELAY_2;
    mibReq.Param.JoinAcceptDelay2 = delay;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::setJoinRetries(unsigned int n)
{
    if (!_initialized) {
	return 0;
    }

    if (n > 255) {
	return 0;
    }

    _JoinRetries = n;

    return 1;
}

int LoRaWANClass::setPublicNetwork(bool enable)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }
    
    mibReq.Type = MIB_PUBLIC_NETWORK;
    mibReq.Param.EnablePublicNetwork = enable;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK){
	return 0;
    }

    _PublicNetwork = enable;

    return 1;
}

int LoRaWANClass::setAdrEnable(bool enable)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }
    
    mibReq.Type = MIB_ADR;
    mibReq.Param.AdrEnable = enable;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    if (!enable) {
	mibReq.Type = MIB_CHANNELS_DATARATE;
	mibReq.Param.ChannelsDatarate = _DataRate;
	LoRaWANMibSetRequestConfirm(&mibReq);

	mibReq.Type = MIB_CHANNELS_TX_POWER;
	mibReq.Param.ChannelsTxPower = _TxPower;
	LoRaWANMibSetRequestConfirm(&mibReq);
    }

    _AdrEnable = enable;

    return 1;
}

int LoRaWANClass::setDataRate(unsigned int datarate)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    mibReq.Type = MIB_CHANNELS_DEFAULT_DATARATE;
    mibReq.Param.ChannelsDefaultDatarate = datarate;
	
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    if (!_AdrEnable || (_session.Joined == LORAWAN_JOINED_NONE))
    {
	mibReq.Type = MIB_CHANNELS_DATARATE;
	mibReq.Param.ChannelsDatarate = datarate;
	
	if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	    return 0;
	}
    }

    _DataRate = datarate;

    return 1;
}

int LoRaWANClass::setTxPower(unsigned int power)
{
    unsigned int txPower;
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }
    
    for (txPower = 10; txPower > 0; txPower--) {
	if (LoRaWANTxPower[_Band][txPower] >= power) {
	    break;
	}
    }

    mibReq.Type = MIB_CHANNELS_DEFAULT_TX_POWER;
    mibReq.Param.ChannelsDefaultTxPower = txPower;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    if (!_AdrEnable || (_session.Joined == LORAWAN_JOINED_NONE))
    {
	mibReq.Type = MIB_CHANNELS_TX_POWER;
	mibReq.Param.ChannelsTxPower = txPower;
	
	if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	    return 0;
	}
    }

    _TxPower = txPower;

    return 1;
}

int LoRaWANClass::setConfirmRetries(unsigned int n)
{
    if (!_initialized) {
	return 0;
    }

    if (n > 255) {
	return 0;
    }

    _ConfirmRetries = n;

    return 1;
}

int LoRaWANClass::setReceiveDelay(unsigned int delay)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    if (delay > 65535) {
	return 0;
    }

    mibReq.Type = MIB_RECEIVE_DELAY_1;
    mibReq.Param.ReceiveDelay1 = delay;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    mibReq.Type = MIB_RECEIVE_DELAY_2;
    mibReq.Param.ReceiveDelay2 = delay + 1000;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::setRX2Channel(unsigned long frequency, unsigned int datarate)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    mibReq.Type = MIB_RX2_CHANNEL;
    mibReq.Param.Rx2Channel.Frequency = frequency;
    mibReq.Param.Rx2Channel.Datarate = datarate;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }
    
    return 1;
}

int LoRaWANClass::setSubBand(unsigned int subband)
{
    uint16_t ChannelsMask[LORA_MAX_NB_CHANNELS / 16];
    unsigned int group;
    MibRequestConfirm_t mibReq;
    
    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    if (!((_Band == AU915) || (_Band == US915))) {
	return 0;
    }

    if (subband > 8) {
	return 0;
    }

    memset(&ChannelsMask[0], 0, sizeof(ChannelsMask));

    if (subband > 0)
    {
	group = subband -1;

	ChannelsMask[group >> 1] = ((group & 1) ? 0xFF00 : 0x00FF);
	ChannelsMask[4] = (0x0001 << group);
    }
    else
    {
	ChannelsMask[0] = 0xFFFF;
	ChannelsMask[1] = 0xFFFF;
	ChannelsMask[2] = 0xFFFF;
	ChannelsMask[3] = 0xFFFF;
	ChannelsMask[4] = 0x00FF;
	ChannelsMask[5] = 0x0000;
    }

    mibReq.Type = MIB_CHANNELS_DEFAULT_MASK;
    mibReq.Param.ChannelsDefaultMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    mibReq.Type = MIB_CHANNELS_MASK;
    mibReq.Param.ChannelsMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::addChannel(unsigned int index, unsigned long frequency, unsigned int drMin, unsigned int drMax)
{
    ChannelParams_t params;

    if (!_initialized) {
	return 0;
    }

    if ((_Band == AU915) || (_Band == US915)) {
	return 0;
    }

    // AS923: index == 0..15
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15

    if (index > 15) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    params.Frequency = frequency;
    params.Rx1Frequency = 0;
    params.DrRange.Fields.Min = drMin;
    params.DrRange.Fields.Max = drMax;
    params.Band = 0;

    if (LoRaWANChannelAdd(index, &params) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::removeChannel(unsigned int index)
{
    if (!_initialized) {
	return 0;
    }

    if ((_Band == AU915) || (_Band == US915)) {
	return 0;
    }

    // AS923: index == 0..15
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15

    if (index > 15) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    if (LoRaWANChannelRemove(index) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

