GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
int LoRaWANClass::enableChannel(unsigned int index)
{
    uint16_t ChannelsMask[LORA_MAX_NB_CHANNELS / 16];
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    // AS923: index == 0..15
    // AU915: index == 0..71
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15
    // US915: index == 0..71

    if ((_Band == AU915) || (_Band == US915)) {
	if (index > 71)	{
	    return 0;
	}
    } else {
	if (index > 15)	{
	    return 0;
	}
    }

    mibReq.Type = MIB_CHANNELS_MASK;

    if (LoRaWANMibGetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }
    
    memcpy(&ChannelsMask[0], mibReq.Param.ChannelsMask, sizeof(ChannelsMask));

    ChannelsMask[index >> 4] |= (1u << (index & 15));

    mibReq.Type = MIB_CHANNELS_MASK;
    mibReq.Param.ChannelsMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::disableChannel(unsigned int index)
{
    uint16_t ChannelsMask[LORA_MAX_NB_CHANNELS / 16];
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    // AS923: index == 0..15
    // AU915: index == 0..71
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15
    // US915: index == 0..71

    if ((_Band == AU915) || (_Band == US915)) {
	if (index > 71)	{
	    return 0;
	}
    } else {
	if (index > 15)	{
	    return 0;
	}
    }

    mibReq.Type = MIB_CHANNELS_MASK;

    if (LoRaWANMibGetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }
    
    memcpy(&ChannelsMask[0], mibReq.Param.ChannelsMask, sizeof(ChannelsMask));

    ChannelsMask[index >> 4] &= ~(1u << (index & 15));

    mibReq.Type = MIB_CHANNELS_MASK;
    mibReq.Param.ChannelsMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::setAntennaGain(float gain)
{
    MibRequestConfirm_t mibReq;

    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    mibReq.Type = MIB_ANTENNA_GAIN;
    mibReq.Param.AntennaGain = gain;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }

    return 1;
}

int LoRaWANClass::setDutyCycle(bool enable)
{
    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    if (!((_Band == EU868) || (_Band == IN865))) {
	return 0;
    }

    LoRaMacTestSetDutyCycleOn(enable);

    return 1;
}

int LoRaWANClass::setReceiveWindows(bool enable)
{
    if (!_initialized) {
	return 0;
    }

    if (_tx_busy) {
	return 0;
    }

    LoRaMacTestRxWindowsOn(enable);

    return 1;
}

void LoRaWANClass::__McpsConfirm( McpsConfirm_t *mcpsConfirm )
{
    if (mcpsConfirm->Status != LORAMAC_EVENT_INFO_STATUS_OK) {
	return;
    }

    switch (mcpsConfirm->McpsRequest) {
    case MCPS_UNCONFIRMED:
	LoRaWAN._session.DataRate = mcpsConfirm->Datarate;
	LoRaWAN._session.TxPower = mcpsConfirm->TxPower;

	LoRaWAN._tx_ack = 1;
	LoRaWAN._tx_busy = false;
	    
	if (LoRaWAN._transmitCallback) {
	    armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)LoRaWAN._transmitCallback, NULL, 0);
	} else {
	    stm32l0_system_wakeup();
	}
	break;

    case MCPS_CONFIRMED:
	LoRaWAN._session.DataRate = mcpsConfirm->Datarate;
	LoRaWAN._session.TxPower = mcpsConfirm->TxPower;

	LoRaWAN._tx_ack = mcpsConfirm->AckReceived ? (1 + mcpsConfirm->NbRetries) : 0;
	LoRaWAN._tx_busy = false;
	    
	if (LoRaWAN._transmitCallback) {
	    armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)LoRaWAN._transmitCallback, NULL, 0);
	} else {
	    stm32l0_system_wakeup();
	}
	break;

    case MCPS_PROPRIETARY:
	break;

    default:
	break;
    }
    
    LoRaWAN._session.UpLinkCounter = mcpsConfirm->UpLinkCounter;
}

void LoRaWANClass::__McpsIndication( McpsIndication_t *mcpsIndication )
{
    if (mcpsIndication->Status != LORAMAC_EVENT_INFO_STATUS_OK) {
        return;
    }

    switch (mcpsIndication->McpsIndication) {
    case MCPS_UNCONFIRMED:
	break;

    case MCPS_CONFIRMED:
	break;

    case MCPS_PROPRIETARY:
	break;

    case MCPS_MULTICAST:
	break;

    default:
	break;
    }

    LoRaWAN._rx_snr = mcpsIndication->Snr;
    LoRaWAN._rx_rssi = mcpsIndication->Rssi;

    if (mcpsIndication->RxData == true)
    {
        memcpy(&LoRaWAN._rx_data[0], mcpsIndication->Buffer, mcpsIndication->BufferSize);

	LoRaWAN._rx_index = 0;
	LoRaWAN._rx_size = mcpsIndication->BufferSize; 
	LoRaWAN._rx_port = mcpsIndication->Port;

	if (LoRaWAN._receiveCallback) {
	    armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)LoRaWAN._receiveCallback, NULL, 0);
	} else {
	    stm32l0_system_wakeup();
	}
    }

    LoRaWAN._session.DownLinkCounter = mcpsIndication->DownLinkCounter;
}

void LoRaWANClass::__MlmeConfirm( MlmeConfirm_t *mlmeConfirm )
{
    MibRequestConfirm_t mibReq;

    switch (mlmeConfirm->MlmeRequest) {
    case MLME_JOIN:
	if (mlmeConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK)
	{
	    mibReq.Type = MIB_DEV_ADDR;
	    LoRaMacMibGetRequestConfirm(&mibReq);
	    LoRaWAN._session.DevAddr = mibReq.Param.DevAddr;

	    mibReq.Type = MIB_NWK_SKEY;
	    LoRaMacMibGetRequestConfirm(&mibReq);
	    memcpy(LoRaWAN._session.NwkSKey, mibReq.Param.NwkSKey, 16);

	    mibReq.Type = MIB_APP_SKEY;
	    LoRaMacMibGetRequestConfirm(&mibReq);
	    memcpy(LoRaWAN._session.AppSKey, mibReq.Param.AppSKey, 16);

	    LoRaWAN._session.Joined = LORAWAN_JOINED_OTAA;

	    LoRaWAN._tx_ack = 1 + mlmeConfirm->NbRetries;
	    LoRaWAN._tx_busy = false;
	}
	else
	{
	    LoRaWAN._tx_ack = 0;
	    LoRaWAN._tx_busy = false;
	}

	if (LoRaWAN._transmitCallback) {
	    armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)LoRaWAN._transmitCallback, NULL, 0);
	} else {
	    stm32l0_system_wakeup();
	}
	break;

    case MLME_LINK_CHECK:
	if (mlmeConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK)
	{
	    LoRaWAN._rx_margin = mlmeConfirm->DemodMargin;
	    LoRaWAN._rx_gateways = mlmeConfirm->NbGateways;
	    LoRaWAN._rx_ack = true;

	    if (LoRaWAN._receiveCallback) {
		armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)LoRaWAN._receiveCallback, NULL, 0);
	    } else {
		stm32l0_system_wakeup();
	    }
	}
	break;

    default:
	break;
    }
}

LoRaWANClass LoRaWAN;
